#include "map.h"

//==========================================================
// デフォルトコンストラクタ
//==========================================================
Map::Map() : Entity()
{
	// データ初期化
	for (int i = 0; i < mapNS::MAP_HEIGHT; i++) {
		for (int j = 0; j < mapNS::MAP_WIDTH; j++) {
			tileMap[i][j] = mapNS::mapData[i][j];
			tileCol[i][j] = mapNS::colData[i][j];
			tileObj[i][j] = mapNS::objData[i][j];
		}
	}
};

////==========================================================
// マップを描画
//==========================================================
void Map::draw()
{
	Image::draw();
}

////========================================================
// 1フレーム毎に呼び出し
//==========================================================
void Map::update(float frameTime)
{

}

//==========================================================
// マップデータの更新　引き数は更新したい座標値と更新する値
//==========================================================
void Map::updateMapData(float x, float y, int val)
{
	// 座標をインデックスに変更
	int px = (int)(x / 32);
	int py = (int)(y / 32);

	// 座標値を更新
	tileMap[px][py] = val;
}

//==========================================================
// マップ当たり判定の更新 引き数は更新したい座標値と更新する値
// val -> 0 : 判定なし　val -> 1 : 判定あり/
//==========================================================
void Map::updateMapCol(float x, float y, int val)
{
	// 座標値をインデックスに変更
	int px = (int)(x / 32);
	int py = (int)(y / 32);

	// 座標値を更新
	tileCol[px][py] = val;
}

//==========================================================
// マップ上のオブジェクトデータ更新　引き数は更新したい座標値と更新する値
//==========================================================
void Map::updateMapObj(float x, float y, int val)
{
	// 座標値をインデックスに変更
	int px = (int)(x / 32);
	int py = (int)(y / 32);

	// 座標値を更新
	tileObj[px][py] = val;
}